TurbulentOgive/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        nFaces          54000;
        startFace       107390;
    }
    back
    {
        type            wedge;
        nFaces          54000;
        startFace       161390;
    }
    outlet
    {
        type            patch;
        nFaces          160;
        startFace       215390;
    }
    inlet
    {
        type            patch;
        nFaces          450;
        startFace       215550;
    }
    base
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          60;
        startFace       216000;
    }
    ogive
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          300;
        startFace       216060;
    }
)

// ************************************************************************* //
