TurbulentOgive/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const/*sutherland*/;
    thermo          hConst/*hPolynomial*/;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

// Note: these are the properties for a "normalised" inviscid gas
//       for which the speed of sound is 1 m/s at a temperature of 1K
//       and gamma = 7/5
mixture
{
    specie
    {
        molWeight       28.97;
    }
    thermodynamics
    {
        /*Hf              0;
        Sf              0;
        CpCoeffs<8>     (1057.5 -0.4489 1.1407e-3 -7.9999e-7 1.9327e-10 0 0 0 );*/
        hf              0;
        Cp              1004.35;
    }
    transport
    {
        /*As              1.458e-6;
        Ts              110.4;*/
        mu              1.8e-5;
        Pr              1;
    }
}


// ************************************************************************* //
